In [1]:
import pandas as pd
import numpy as np

### 1a

In [40]:
id = [1,2,3,4,5,6,7]
Name = ['John','Mike','Sally','Jane','Joe','Dan','Phil']
Salary = [300,200,550,500,600,600,550]
manager_id = [3,3,4,7,7,3,'']

employee_table = pd.DataFrame({'id':id, 'Name':Name, 'Salary':Salary, 'manager_id':manager_id}).set_index('id')
employee_table

     Name  Salary manager_id
id
1    John     300          3
2    Mike     200          3
3   Sally     550          4
4    Jane     500          7
5     Joe     600          7
6     Dan     600          3
7    Phil     550

In [41]:
# Ignore the last row, because Phil does not have a manager
# Adjust manager_id for 0 index
for i in range(len(Salary)-1):
    if Salary[i] > Salary[manager_id[i]-1]:
        print(Name[i])

Sally
Joe
Dan

### 1b

In [42]:
managers = []

for i in range(len(manager_id)-1):
    managers.append(Name[manager_id[i]-1])
set(managers)

{'Jane', 'Phil', 'Sally'}

*We can see that non-managers are John, Mike, Doe and Dan*

In [43]:
non_managers = pd.DataFrame()
non_managers = non_managers.append(employee_table.loc[employee_table['Name'] == 'John'])
non_managers = non_managers.append(employee_table.loc[employee_table['Name'] == 'Mike'])
non_managers = non_managers.append(employee_table.loc[employee_table['Name'] == 'Joe'])
non_managers = non_managers.append(employee_table.loc[employee_table['Name'] == 'Dan'])
non_managers

    Name  Salary manager_id
id
1   John     300          3
2   Mike     200          3
5    Joe     600          7
6    Dan     600          3

In [44]:
non_managers['Salary'].mean()

425.0